const month = {
    1: 'بهاء',
    2: 'جلال',
    3: 'جمال',
    4: 'عظمت',
    5: 'نور',
    6: 'رحمت',
    7: 'کلمات',
    8: 'کمال',
    9: 'اسماء',
    10: 'عزّت',
    11: 'مشیّت',
    12: 'علم',
    13: 'قدرت',
    14: 'قول',
    15: 'مسائل',
    16: 'شرف',
    17: 'سلطان',
    18: 'ملک',
    19: 'علاء',
    20: 'ایّام ها',
};

const monthL = {
    1: 'بهاء',
    2: 'جلال',
    3: 'جمال',
    4: 'عظمت',
    5: 'نور',
    6: 'رحمت',
    7: 'کلمات',
    8: 'کمال',
    9: 'اسماء',
    10: 'عزّت',
    11: 'مشیّت',
    12: 'علم',
    13: 'قدرت',
    14: 'قول',
    15: 'مسائل',
    16: 'شرف',
    17: 'سلطان',
    18: 'ملک',
    19: 'علاء',
    20: 'ایّام ها',
};

const holyDay = {
    1: 'عید نوروز',
    2: 'روز اوّل عید رضوان',
    3: 'روز نهم عید رضوان',
    4: 'روز دوازدهم عید رضوان',
    5: 'اظهار امر حضرت باب',
    6: 'صعود حضرت بهاءالله',
    7: 'شهادت حضرت باب',
    8: 'تولّد حضرت باب',
    9: 'تولّد حضرت بهاءالله',
    10: 'روز عهد و میثاق',
    11: 'صعود حضرت عبدالبهاء',
};

const weekday = {
    1: 'جلال',
    2: 'جمال',
    3: 'کمال',
    4: 'فضال',
    5: 'عدال',
    6: 'استجلال',
    7: 'استقلال',
};

const weekdayAbbr3 = {
    1: 'جلا',
    2: 'جما',
    3: 'کما',
    4: 'فضا',
    5: 'عدا',
    6: 'اسج',
    7: 'اسق',
};

const weekdayAbbr2 = {
    1: 'جل',
    2: 'جم',
    3: 'کم',
    4: 'فض',
    5: 'عد',
    6: 'اج',
    7: 'اق',
};

const weekdayL = {
    1: 'جلال',
    2: 'جمال',
    3: 'کمال',
    4: 'فضال',
    5: 'عدال',
    6: 'استجلال',
    7: 'استقلال',
};

const yearInVahid = {
    1: 'الف',
    2: 'باء',
    3: 'اب',
    4: 'دال',
    5: 'باب',
    6: 'واو',
    7: 'ابد',
    8: 'جاد',
    9: 'بهاء',
    10: 'حبّ',
    11: 'بهّاج',
    12: 'جواب',
    13: 'احد',
    14: 'وهّاب',
    15: 'وداد',
    16: 'بدیع',
    17: 'بهی',
    18: 'ابهی',
    19: 'واحد',
};

const vahid = 'واحد';
const kulliShay = 'کلّ شیء';
const BE = 'بدیع';
const badiCalendar = 'تقویم بدیع';
const unicodeCharForZero = '۰';
const defaultFormat = '&#8207;d MML y BE&#8207;';

export {
    month,
    monthL,
    holyDay,
    weekday,
    weekdayAbbr3,
    weekdayAbbr2,
    weekdayL,
    yearInVahid,
    vahid,
    kulliShay,
    BE,
    badiCalendar,
    unicodeCharForZero,
    defaultFormat,
};
